{
  "personal": {
    "name": "Alejandro Ortiz Perdomo",
    "title": "AI Engineer | Machine Learning Engineer",
    "phone": "+57 319 666 3193",
    "email": "alejortizp@gmail.com",
    "location": {"es": "Bogotá, Colombia", "en": "Bogotá, Colombia"},
    "linkedin": {
      "url": "https://www.linkedin.com/in/alejandro-ortiz-perdomo-a35348116/",
      "label": "LinkedIn",
      "display_url": "linkedin.com/in/alejandro-ortiz-perdomo"
    },
    "github": {
      "url": "https://github.com/alejortizp",
      "label": "alejortizp",
      "display_url": "github.com/alejortizp"
    },
    "portfolio": {
      "url": "https://alejortizp.github.io/curriculum_HV/",
      "label": "Portfolio",
      "display_url": "alejortizp.github.io/curriculum_HV"
    },
    "formspree_id": "xzdaygrk",
    "google_analytics_id": ""
  },

  "profiles": {
    "default": {
      "es": "AI Engineer especializado en <strong>GenAI/RAG</strong> y <strong>LLMs</strong> con track record productizando soluciones en <strong>Azure</strong>. Experiencia end-to-end desde investigación hasta deployment en producción con <strong>MLOps</strong>. Desarrollador de agentes inteligentes con <strong>LangChain</strong> para automatización de workflows empresariales. Combino base matemática sólida (Estadística) con ingeniería de software moderna (CI/CD, Docker) para crear sistemas de IA escalables y confiables.",
      "en": "AI Engineer specialized in <strong>GenAI/RAG</strong> and <strong>LLMs</strong> with proven track record productionizing solutions on <strong>Azure</strong>. End-to-end experience from research to production deployment with <strong>MLOps</strong>. Developer of intelligent agents with <strong>LangChain</strong> for enterprise workflow automation. Combines strong mathematical foundation (Statistics) with modern software engineering (CI/CD, Docker) to build scalable and reliable AI systems."
    },
    "ai-engineer": {
      "es": "AI Engineer con experiencia productizando soluciones de <strong>GenAI/RAG</strong> en <strong>Azure</strong>. Especializado en diseño e implementación de <strong>agentes inteligentes</strong> con <strong>LangChain</strong> y <strong>Azure OpenAI</strong> para automatización empresarial. Track record procesando <strong>10k+ consultas/mes</strong> con agentes conversacionales y pipelines de matching semántico con <strong>95%</strong> de precisión. Combino Maestría en Ingeniería de Software (en curso) con base en Estadística para diseñar sistemas de IA escalables y listos para producción.",
      "en": "AI Engineer with proven experience productionizing <strong>GenAI/RAG</strong> solutions on <strong>Azure</strong>. Specialized in designing and deploying <strong>intelligent agents</strong> with <strong>LangChain</strong> and <strong>Azure OpenAI</strong> for enterprise automation. Track record processing <strong>10k+ queries/month</strong> with conversational agents and semantic matching pipelines with <strong>95%</strong> accuracy. Combines Master in Software Engineering (in progress) with a Statistics foundation to design scalable, production-ready AI systems."
    },
    "ml-engineer": {
      "es": "Machine Learning Engineer con experiencia end-to-end desde experimentación hasta producción. Especializado en modelos predictivos (<strong>churn, propensión, NBO</strong>) con impacto cuantificable: <strong>Lift 3.0</strong>, <strong>+15%</strong> conversión, <strong>+60%</strong> contactabilidad. Dominio de <strong>Scikit-learn, LightGBM, PyTorch</strong> y <strong>Databricks + MLflow</strong> para MLOps. Combino base matemática sólida (Estadística) con ingeniería de software moderna para crear pipelines de ML confiables y escalables.",
      "en": "Machine Learning Engineer with end-to-end experience from experimentation to production. Specialized in predictive models (<strong>churn, propensity, NBO</strong>) with quantifiable impact: <strong>Lift 3.0</strong>, <strong>+15%</strong> conversion, <strong>+60%</strong> contactability. Proficient in <strong>Scikit-learn, LightGBM, PyTorch</strong> and <strong>Databricks + MLflow</strong> for MLOps. Combines strong mathematical foundation (Statistics) with modern software engineering to build reliable and scalable ML pipelines."
    },
    "mlops": {
      "es": "MLOps Engineer especializado en llevar modelos de ML desde experimentación hasta <strong>producción confiable</strong>. Implementé pipelines <strong>CI/CD</strong> con <strong>Databricks + MLflow</strong> que redujeron deployment de 2 semanas a <strong>2 días</strong>. Diseñé sistemas de monitoreo de <strong>data/model drift</strong> con alertas automáticas de reentrenamiento. Dominio de <strong>Docker, Azure AI, FastAPI</strong> y <strong>GitHub Actions</strong> para infraestructura de ML escalable y reproducible.",
      "en": "MLOps Engineer specialized in taking ML models from experimentation to <strong>reliable production</strong>. Implemented <strong>CI/CD</strong> pipelines with <strong>Databricks + MLflow</strong> reducing deployment from 2 weeks to <strong>2 days</strong>. Designed <strong>data/model drift</strong> monitoring systems with automated retraining alerts. Proficient in <strong>Docker, Azure AI, FastAPI</strong> and <strong>GitHub Actions</strong> for scalable and reproducible ML infrastructure."
    }
  },

  "experience": [
    {
      "current": true,
      "langs": ["es", "en"],
      "title": {"es": "Consultor Desarrollador IA", "en": "AI Developer Consultant"},
      "company": "Periferia IT",
      "date": {"es": "Jun 2025 – Actualidad", "en": "Jun 2025 – Present"},
      "items": {
        "es": [
          "<strong>Sistema de Matching CV-Oferta:</strong> Desarrollé pipeline completo con <strong>Azure Document Intelligence</strong> + <strong>AI Search</strong> que procesa 500+ CVs/día con 95% de precisión en extracción. Búsqueda semántica con embeddings reduce tiempo de screening en <strong>70%</strong>.",
          "<strong>Automatización Inteligente:</strong> Implementé vectorización y chunking semántico optimizado para matching candidato-oferta, mejorando la calidad de recomendaciones en <strong>40%</strong> vs. keyword search tradicional.",
          "<strong>Impacto:</strong> Sistema procesando <strong>10k+ búsquedas/mes</strong> con latencia <200ms. Stack: Python, Azure AI Search, Document Intelligence, FastAPI."
        ],
        "en": [
          "<strong>CV-Job Matching System:</strong> Built complete pipeline with <strong>Azure Document Intelligence</strong> + <strong>AI Search</strong> processing 500+ CVs/day with 95% extraction accuracy. Semantic search with embeddings reduced screening time by <strong>70%</strong>.",
          "<strong>Intelligent Automation:</strong> Implemented vectorization and optimized semantic chunking for candidate-job matching, improving recommendation quality by <strong>40%</strong> vs. traditional keyword search.",
          "<strong>Impact:</strong> System handling <strong>10k+ searches/month</strong> with <200ms latency. Stack: Python, Azure AI Search, Document Intelligence, FastAPI."
        ]
      }
    },
    {
      "current": false,
      "langs": ["es", "en"],
      "title": {"es": "Machine Learning Engineer", "en": "Machine Learning Engineer"},
      "company": "Global Hitss",
      "date": {"es": "Sep 2023 – Jun 2025", "en": "Sep 2023 – Jun 2025"},
      "items": {
        "es": [
          "<strong>GenAI & RAG:</strong> Diseñé e implementé agente conversacional con RAG que redujo tickets de soporte en <strong>40%</strong>, procesando <strong>10k+ consultas/mes</strong> con 85% de resolución sin escalamiento. Stack: LangChain, Azure OpenAI, FAISS.",
          "<strong>MLOps:</strong> Implementé pipeline CI/CD en <strong>Databricks + MLflow</strong> que redujo tiempo de deployment de 2 semanas a <strong>2 días</strong>. Modelos en producción con monitoreo automático de drift y reentrenamiento.",
          "<strong>Reinforcement Learning:</strong> Productivicé sistema <em>Next Best Offer</em> (NBO) con A/B testing que incrementó conversión en <strong>15%</strong> y revenue de <strong>$10k por persona</strong>.",
          "<strong>Modelo de Churn:</strong> Desarrollé modelo predictivo con <strong>Lift de 3.0</strong> y recall del 82% en top decil, integrado a CRM para retención proactiva. Impactó <strong>50k+ clientes</strong>."
        ],
        "en": [
          "<strong>GenAI & RAG:</strong> Designed and deployed conversational agent with RAG that reduced support tickets by <strong>40%</strong>, processing <strong>10k+ queries/month</strong> with 85% resolution without escalation. Stack: LangChain, Azure OpenAI, FAISS.",
          "<strong>MLOps:</strong> Implemented CI/CD pipeline in <strong>Databricks + MLflow</strong> reducing deployment time from 2 weeks to <strong>2 days</strong>. Production models with automatic drift monitoring and retraining.",
          "<strong>Reinforcement Learning:</strong> Productized <em>Next Best Offer</em> (NBO) system with A/B testing that increased conversion by <strong>15%</strong> and revenue by <strong>$10k per person</strong>.",
          "<strong>Churn Model:</strong> Developed predictive model with <strong>Lift of 3.0</strong> and 82% recall in top decile, integrated to CRM for proactive retention. Impacted <strong>50k+ customers</strong>."
        ]
      }
    },
    {
      "current": false,
      "langs": ["es", "en"],
      "title": {"es": "Consultor Machine Learning", "en": "Machine Learning Consultant"},
      "company": "Grupo CINTE",
      "date": {"es": "Ago – Sep 2023 (Proyecto puntual)", "en": "Aug – Sep 2023 (Short-term project)"},
      "items": {
        "es": [
          "<strong>Observabilidad ML:</strong> Diseñé metodología integral de monitoreo para detección de <em>data/model drift</em> con alertas automáticas de reentrenamiento, adoptada como estándar del equipo de ciencia de datos.",
          "<strong>Optimización:</strong> Audité y optimicé algoritmos LightGBM y Random Forest, mejorando eficiencia computacional y reduciendo tiempos de inferencia."
        ],
        "en": [
          "<strong>ML Observability:</strong> Designed comprehensive monitoring methodology for <em>data/model drift</em> detection with automated retraining alerts, adopted as the data science team's standard.",
          "<strong>Optimization:</strong> Audited and optimized LightGBM and Random Forest algorithms, improving computational efficiency and reducing inference times."
        ]
      }
    },
    {
      "current": false,
      "langs": ["es", "en"],
      "title": {"es": "Data Scientist", "en": "Data Scientist"},
      "company": "NAE",
      "date": {"es": "Mar 2023 – Jul 2023", "en": "Mar 2023 – Jul 2023"},
      "items": {
        "es": [
          "<strong>Modelo de Contactabilidad:</strong> Desarrollé modelo con <strong>LightGBM</strong> que incrementó tasa de contacto efectivo en <strong>60%</strong> (de 25% a 40%), optimizando ventanas horarias y canales. Impactó campañas con <strong>100k+ contactos/mes</strong>."
        ],
        "en": [
          "<strong>Contactability Model:</strong> Developed <strong>LightGBM</strong> model that increased effective contact rate by <strong>60%</strong> (from 25% to 40%), optimizing time windows and channels. Impacted campaigns with <strong>100k+ contacts/month</strong>."
        ]
      }
    },
    {
      "current": false,
      "langs": ["es", "en"],
      "title": {"es": "Data Scientist II", "en": "Data Scientist II"},
      "company": "Xolit",
      "date": {"es": "May 2022 – Ene 2023", "en": "May 2022 – Jan 2023"},
      "items": {
        "es": [
          "<strong>Modelo de Propensión de Pago:</strong> Desarrollé modelo predictivo de probabilidad de pago y acuerdo de cartera, maximizando el recaudo mediante <strong>focos automáticos</strong> de gestión priorizados por propensión.",
          "<strong>Sistema de Recomendación:</strong> Implementé motor de recomendación de franja horaria óptima de contacto por titular, incrementando la efectividad de la gestión de cobranza.",
          "<strong>Segmentación de Clientes:</strong> Diseñé estrategia de marketing basada en clustering de titulares, permitiendo comunicación personalizada por segmento para optimizar tasas de recaudo.",
          "<strong>Monitoreo:</strong> Construí dashboards en <strong>Power BI</strong> para seguimiento de KPIs de recaudo y métricas de desempeño de modelos en producción."
        ],
        "en": [
          "<strong>Payment Propensity Model:</strong> Developed predictive model for payment probability and portfolio agreement, maximizing collection through <strong>automated management priorities</strong> based on propensity scores.",
          "<strong>Recommendation System:</strong> Implemented optimal contact time-slot recommendation engine per account holder, increasing debt collection management effectiveness.",
          "<strong>Customer Segmentation:</strong> Designed clustering-based marketing strategy for account holders, enabling personalized communication per segment to optimize collection rates.",
          "<strong>Monitoring:</strong> Built <strong>Power BI</strong> dashboards for tracking collection KPIs and production model performance metrics."
        ]
      }
    },
    {
      "current": false,
      "langs": ["es"],
      "title": {"es": "Analista de Datos / BI"},
      "company": "Savia Salud EPS",
      "date": {"es": "Ago 2018 – Abr 2021"},
      "items": {
        "es": [
          "<strong>Business Intelligence:</strong> Desarrollé dashboards estratégicos en <strong>Qlik Sense</strong> para toma de decisiones, brindando visibilidad de KPIs operacionales y financieros a stakeholders clave.",
          "<strong>Pipelines ETL:</strong> Diseñé y construí procesos ETL para consolidar datos de múltiples fuentes, garantizando integridad y trazabilidad de la información.",
          "<strong>Gestión de Requerimientos:</strong> Lideré levantamiento de requerimientos técnicos y funcionales con usuarios clave, alineando soluciones BI con objetivos organizacionales."
        ]
      }
    }
  ],

  "projects": [
    {
      "emoji": "🤖",
      "title": {"es": "Agente Email con LangChain", "en": "Email Agent with LangChain"},
      "url": "https://github.com/alejortizp/email-agent",
      "url_label": "github.com/alejortizp/email-agent",
      "description": {
        "es": "Agente inteligente que consulta emails vía IMAP, clasifica con LLM y genera respuestas contextuales automáticas. Reduce tiempo de respuesta en <strong>80%</strong>.",
        "en": "Intelligent agent that queries emails via IMAP, classifies with LLM, and generates contextual automatic responses. Reduces response time by <strong>80%</strong>."
      },
      "stack": "LangChain, Azure OpenAI, IMAP, Python, Prompt Engineering"
    },
    {
      "emoji": "💬",
      "title": {"es": "NL-to-SQL/Pandas Agent", "en": "NL-to-SQL/Pandas Agent"},
      "url": "https://github.com/alejortizp/Agente-de-Consultas---High-Garden-Coffee---Agentic-Rag",
      "url_label": "github.com/alejortizp/nl-to-code",
      "description": {
        "es": "Agente que traduce lenguaje natural a queries SQL y operaciones Pandas. Incluye validación de código, ejecución segura en sandbox y visualización automática de resultados.",
        "en": "Agent that translates natural language to SQL queries and Pandas operations. Includes code validation, secure sandbox execution, and automatic results visualization."
      },
      "stack": "LangChain, SQL, Pandas, Code Interpreter, ReAct Pattern"
    },
    {
      "emoji": "🛒",
      "title": {"es": "RAG Restaurant Ordering System", "en": "RAG Restaurant Ordering System"},
      "url": "https://github.com/alejortizp/rag-ordering",
      "url_label": "github.com/alejortizp/rag-ordering",
      "description": {
        "es": "Sistema de pedidos conversacional con RAG sobre menú de restaurante. Agente procesa selección de productos en lenguaje natural, genera factura y calcula totales. Incluye gestión de inventario.",
        "en": "Conversational ordering system with RAG over restaurant menu. Agent processes product selection in natural language, generates invoices, and calculates totals. Includes inventory management."
      },
      "stack": "LangChain, FAISS, Azure OpenAI, FastAPI, Streamlit"
    }
  ],

  "education": {
    "degrees": [
      {
        "title": {"es": "Maestría en Ingeniería de Software", "en": "Master in Software Engineering"},
        "institution": "Universidad de los Andes",
        "date": {"es": "2025 – En proceso", "en": "2025 – In Progress"},
        "current": true
      },
      {
        "title": {"es": "Estadístico", "en": "B.S. in Statistics"},
        "institution": "Universidad del Valle",
        "date": "2011 – 2016",
        "current": false
      }
    ],
    "diplomas": [
      {
        "title": {"es": "Diplomado Ciencia de Datos (DS4A)", "en": "Data Science Diploma (DS4A)"},
        "institution": "Correlation One",
        "year": "2022"
      },
      {
        "title": {"es": "Diplomado Deep Learning", "en": "Deep Learning Diploma"},
        "institution": "Univ. Autónoma Occidente",
        "year": "2023"
      }
    ]
  },

  "tech_stack": [
    {
      "category": "GenAI & LLMs",
      "items": [
        [{"name": "LangChain", "years": 2, "detail": "(Agents, RAG)"}],
        [{"name": "Azure OpenAI", "years": 2, "detail": "(GPT-4, Embeddings)"}],
        [{"name": "Prompt Engineering", "years": 2}],
        [{"name": "Vector DBs", "years": 2, "detail": "(FAISS, Pinecone)"}]
      ]
    },
    {
      "category": "Azure AI & Cloud",
      "items": [
        [{"name": "Azure AI Search", "years": 1}],
        [{"name": "Document Intelligence", "years": 1}],
        [{"name": "Databricks + MLflow", "years": 3}]
      ]
    },
    {
      "category": "ML/DL Frameworks",
      "items": [
        [{"name": "PyTorch", "years": 2}, {"name": "TensorFlow", "years": 3}],
        [{"name": "Scikit-learn, XGBoost, LightGBM", "years": 4}],
        [{"name": "Hugging Face Transformers", "years": 2}]
      ]
    },
    {
      "category": "MLOps & Engineering",
      "items": [
        [{"name": "Python, SQL, PySpark", "years": 7}],
        [{"name": "Docker, CI/CD", "years": 2}],
        [{"name": "FastAPI, Streamlit", "years": 3}],
        [{"name": "Git, GitHub Actions", "years": 4}]
      ]
    }
  ],

  "power_skills": {
    "es": ["Comunicación efectiva", "Resolución de problemas", "Pensamiento analítico", "Trabajo en equipo", "Adaptabilidad", "Aprendizaje continuo", "Gestión del tiempo", "Liderazgo técnico"],
    "en": ["Effective Communication", "Problem Solving", "Analytical Thinking", "Team Collaboration", "Adaptability", "Continuous Learning", "Time Management", "Technical Leadership"]
  },

  "languages": [
    {
      "flag": "🇪🇸",
      "name": {"es": "Español", "en": "Spanish"},
      "level": {"es": "Nativo", "en": "Native"}
    },
    {
      "flag": "🇬🇧",
      "name": {"es": "Inglés", "en": "English"},
      "level": {"es": "Profesional Avanzado (B2/C1)", "en": "Professional Proficiency (B2/C1)"}
    }
  ],

  "certifications": [
    {
      "title": {"es": "AI-102: Microsoft Certified Azure AI Engineer Associate", "en": "AI-102: Microsoft Certified Azure AI Engineer Associate"},
      "detail": null,
      "institution": {"es": "Udemy", "en": "Udemy"},
      "date": {"es": "Feb 2026", "en": "Feb 2026"}
    },
    {
      "title": {"es": "NLP Specialization", "en": "NLP Specialization"},
      "detail": "(RAG/Transformers)",
      "institution": "Coursera",
      "date": {"es": "Jun 2025", "en": "Jun 2025"}
    },
    {
      "title": {"es": "PyTorch Ultimate", "en": "PyTorch Ultimate"},
      "detail": null,
      "institution": "Coursera",
      "date": {"es": "Mar 2025", "en": "Mar 2025"}
    },
    {
      "title": {"es": "MLOps y Databricks", "en": "MLOps and Databricks"},
      "detail": null,
      "institution": "Netec",
      "date": {"es": "Dic 2024", "en": "Dec 2024"}
    },
    {
      "title": {"es": "AWS Cloud Practitioner", "en": "AWS Cloud Practitioner"},
      "detail": null,
      "institution": "Udemy",
      "date": {"es": "Feb 2022", "en": "Feb 2022"}
    }
  ]
}
